[pretresse.A_Creature_grande_pretresse H7Creature]
mName="神圣女祭司"
mLore="当宗教裁判所关闭时，男性审判官转变为艾尔拉思的祭司。女性审判官，因为人数很少，组成了神圣女祭司的教团。作为强大的精神导师，她们很少介入帝国的生活。然而，如果有需要，皇帝可以请求她们的帮助。而她们总是回应。"

[pretresse.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天界惩戒"
mTooltip="对 1x4 区域内的敌方生物造成伤害。受影响生物在每次攻击时也会受到额外伤害：在接下来的 %buff.buff.durini 回合内，每次攻击受到相当于施法者队伍中每位神圣女祭司 5 %ICON_LIGHT 光系伤害。\n每场战斗一次。"

[pretresse.A_Ranged H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="远程攻击"
mTooltip="远程攻击"

[pretresse.A_RangedAttack_Light_Beam H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="远程攻击"
mTooltip="远程攻击"

[pretresse.A_WitheringVenom_Buff H7BaseBuff]
mName="天界惩戒"
mTooltip="该生物每次造成伤害时，会受到相当于施法者队伍中每位神圣女祭司 5 %ICON_LIGHT 光系伤害。持续 %durnow 回合。"

[Archange.A_Prophete H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="先知幸运"
mTooltip="每当此生物受到伤害时，友方单位获得 %buff.buff.stat %buff.buff.stat.icon 幸运，直到战斗结束。"

[Archange.A_archange H7Creature]
mName="大天使"
mLore="大天使是天使的最高阶指挥官。他们在远古战争中指挥天界部队。每位大天使麾下有 5 名智天使，其下又有 20 名昊天使和炽天使。这意味着每位大天使指挥着超过 100 名天使。然而今天，他们的种族已不那么繁多，只剩下十几位大天使。他们是天使中最美丽的，有着欢快的面容，闪耀着光芒的白发，四只巨大的金色翅膀，身高 3 米。当然，还有几个世纪的战斗经验。\n\n招募所需稀有资源：\n5 龙钢"

[Archange.A_MagmaPond_add H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天界复仇"
mTooltip="此单位第一次损失队伍中的生物时，获得能力：天界闪电，对所有敌方生物造成相当于队伍中每位大天使 120 点的伤害。"

[Archange.A_chance_Buff H7BaseBuff]
mName="先知幸运"
mTooltip="每当该生物受到伤害时，它获得 %buff.buff.stat %buff.buff.stat.icon 最大伤害，直到其下一回合。"

[Archange.A_MeleeAttack H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="近战攻击"
mTooltip="激活以执行默认攻击。"

[Archange.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天界闪电"
mTooltip="对所有敌方单位造成 %d.min 到 %d.max %ICON_LIGHT 光系伤害，每场战斗一次。"

[Archange.A_Wait H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="至高祝福"
mTooltip="所有友方生物获得 +10 %icon_morale 士气，直到其下一回合结束。\n此生物还有 30% 几率治疗或复活所有友方生物 %d.min %icon_health 生命值。\n使用此能力不消耗该单位的行动，但会使其执行等待动作。"

[Archange.A_WAIT8HEAL_Buff H7BaseBuff]
mName="至高祝福"
mTooltip="该生物拥有 %stat %icon_morale 士气，持续 %durnow 回合。"